<?php
echo "<img src='img/img_main_html.webp' width='100%'><h1>HTML (Hypertext Markup Language)</h1>
<p>HTML (от англ. HyperText Markup Language — «язык гипертекстовой разметки») 
— стандартизированный язык разметки документов для просмотра веб-страниц в браузере. 
Веб-браузеры получают HTML документ от сервера по протоколам HTTP/HTTPS или 
открывают с локального диска, далее интерпретируют код в интерфейс, который 
будет отображаться на экране монитора.</p>
<p>Элементы HTML являются строительными блоками HTML страниц. С помощью HTML 
разные конструкции, изображения и другие объекты, такие как интерактивная веб-форма, 
могут быть встроены в отображаемую страницу. HTML предоставляет средства для 
создания заголовков, абзацев, списков, ссылок, цитат и других элементов. Элементы 
HTML выделяются тегами, записанными с использованием угловых скобок. Такие теги, 
как</p>
<p><xmp><img /></xmp></p>
<p>и</p>
<p><xmp><input /></xmp></p>
<p>напрямую вводят контент на страницу. Другие теги, такие как</p>
<p><xmp><p></xmp></p>
<p>окружают и оформляют текст внутри себя и могут включать другие 
теги в качестве подэлементов. Браузеры не отображают HTML-теги, но используют 
их для интерпретации содержимого страницы.</p>";
?>
